{"author":"RussoDaFederal","category":2,"commands":[{"defaultParameters":[{"description":"ID of the variable to store the water in case you want to move it later","id":-1,"name":"variable"},{"description":"X coordinate of the leftmost vertex (west)","id":-1,"name":"x"},{"description":"Height of the water surface (in squares)","id":-1,"name":"y"},{"description":"Z coordinate of the topmost vertex (north)","id":-1,"name":"z"},{"description":"Size of the body of water in the X axis (in squares). If equal to 0, it will max out to match the map size","id":-1,"name":"length"},{"description":"Size of the body of water in the Z axis (in squares). If equal to 0, it will max out to match the map size","id":-1,"name":"width"},{"defaultValue":{"k":27,"v":2},"description":"The color of the water","id":-1,"name":"color"}],"description":"Create a rectangular water surface on the map","id":1,"name":"Create water surface"},{"defaultParameters":[{"description":"ID of the variable that holds this body of water","id":-1,"name":"variable"},{"description":"The surface will teleport to the given Y coordinate (height)","id":-1,"name":"y"}],"description":"Assign a new value to the Y (height) coordinate of a given surface","id":2,"name":"Move water surface"},{"id":3,"name":"Initialize sky"},{"defaultParameters":[{"defaultValue":{"k":12,"v":2},"description":"Sun elevation, in degrees (between 0 and 90, 0 being the horizon and 90 fully above the scene)","id":-1,"name":"elevation"},{"description":"Horizontal position of the sun, in degrees from the center of the map","id":-1,"name":"azimuth"}],"id":4,"name":"Update sun position"}],"description":"Enables creating a realistic looking body of water (rectangular surface) from a single command and initializing a realistic sun on the horizon which affects the water reflection. It's also possible to move bodies of water up and down (i.e. for water level puzzles) and moving the sun around (i.e. for a day and night cycle).\n\nWarning! If you have downloaded this plugin directly from the engine, there might be missing files. You can download the missing files from GitHub on the provided link or from the RPG Paper Maker Discord server.","name":"Realistic water and sun","type":1,"version":"1.1.0","website":"https://github.com/yaleksander/RPM-Plugin-Realistic-water-and-sun"}